#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/121]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/203]
proxmox_vm_qemu.k3s-worker-01: Refreshing state... [id=milky-polaris/qemu/127]
proxmox_vm_qemu.k3s-ansible-host: Refreshing state... [id=milky-capella/qemu/126]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/120]
proxmox_vm_qemu.workstation-1: Refreshing state... [id=milky-polaris/qemu/123]
proxmox_vm_qemu.k3s-controller-01: Refreshing state... [id=milky-capella/qemu/125]
proxmox_vm_qemu.gateway-1: Refreshing state... [id=milky-capella/qemu/122]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = <<-EOT
            #cloud-config
            package_update: true
            package_upgrade: true
            packages:
              - python3
              - python3-pip
              - python3-venv
              - ansible-core
              - ansible-lint
              - ansible-mitogen
              - git
            
            users:
              - name: ubuntu
                sudo: ALL=(ALL) NOPASSWD:ALL
                groups: sudo
                shell: /bin/bash
                ssh_authorized_keys:
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCkKIrZEAziZQNOAyyJObgzRLYUvIxn/2Kj2SVoGt/N/CMmYIMV8QaGGaoi0D+dWBxqEXYUhbI6HcsghEQVxz5JOxDwM6Xf23qL6HnuTKQYGS14mabn3AH6bx1J5FjaFwCJ2XZTC4xwEjPTCN6jXynpQpp3ZMCptrSSmabEO8XkwWVsvFMRpzAWtWYSJ8erd+X5qKYnzdvfUhUv6qGMXt84hGPKgg4fWtrNhOtaPPW+xxeoMS6IW7Era1Lxhm5qYrr5CNF5pNmMPIt/rATJNcHX4Wt/F2S4GGjh/wWLws/7aa15M3eml7CBmx008laYjWJk9sYFWNNi2rDjEj2lrjw2lXWe+0rpQytxwiQyF/APL7HSYqegWLoWEDJOZ3YGIoVPpDE8mmJXo1bLwEQ0YkLXvGljnSvv87JymX8mN5M00O/7sUua1hdTqAOZkoc0M/hcT1EuHKztRsCLJN8jq/+U9mBV2mKciKFC8Vst8iA+DcZ5OiXztCj5bH0nxx13OJ0= yuuta@yuuta-ThinkPadE14
            
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
                ssh_import_id:
                  - gh:walkmana-25
                  - gh:sasanqua-dev
            
            
            write_files:
              - content: |
                  -----BEGIN OPENSSH PRIVATE KEY-----
            b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAABlwAAAAdzc2gtcn
            NhAAAAAwEAAQAAAYEApCiK2RAM4mUDTgMsiTm4M0S2FLyMZ/9io9klaBrfzfwjJmCDFfEG
            hhmqItA/nVgcahF2FIWyOh3LIIREFcc+STsQ8DOl39t6i+h57kykGBkteJmm59wB+m8dSe
            RY2hcAidl2UwuMcBIz0wjeo18p6UKad2TAqba0kpmmxDvF5MFlbLxTEacwFrVmEifHq3fl
            +aimJ83b31IVL+qhjF7fOIRjyoIOH1razYTrWjz1vscXqDEuiFuxK2tS8YZuamK6+QjRea
            TZjDyLf6wEyTXB1+FrfxdkuBho4f8Fi8LP+2mteTN3ppewgZsdNPJWmI1iZPbGBVjTYtqw
            4xI9pa48NpV1nvtK6UMrccIkMhfwDy+x0mKnoFi6FhAyTmd2BiKFT6QxPJpiV6NWy8BENG
            JC17xpY50r7/Oycpl/JjeTNNDv+7FLmtYXU6gDmZKHNDP4XE9RLhys7UbAiyTfI6v/lPZg
            VdpinIihQvFbLfIgPg3GeTol87Qo+Wx9J8cddzidAAAFkLLexqGy3sahAAAAB3NzaC1yc2
            EAAAGBAKQoitkQDOJlA04DLIk5uDNEthS8jGf/YqPZJWga3838IyZggxXxBoYZqiLQP51Y
            HGoRdhSFsjodyyCERBXHPkk7EPAzpd/beovoee5MpBgZLXiZpufcAfpvHUnkWNoXAInZdl
            MLjHASM9MI3qNfKelCmndkwKm2tJKZpsQ7xeTBZWy8UxGnMBa1ZhInx6t35fmopifN299S
            FS/qoYxe3ziEY8qCDh9a2s2E61o89b7HF6gxLohbsStrUvGGbmpiuvkI0Xmk2Yw8i3+sBM
            k1wdfha38XZLgYaOH/BYvCz/tprXkzd6aXsIGbHTTyVpiNYmT2xgVY02LasOMSPaWuPDaV
            dZ77SulDK3HCJDIX8A8vsdJip6BYuhYQMk5ndgYihU+kMTyaYlejVsvARDRiQte8aWOdK+
            /zsnKZfyY3kzTQ7/uxS5rWF1OoA5mShzQz+FxPUS4crO1GwIsk3yOr/5T2YFXaYpyIoULx
            Wy3yID4Nxnk6JfO0KPlsfSfHHXc4nQAAAAMBAAEAAAGAHcVihQI1q/tQ0Z2evpZSsy2Tbg
            hR2GyHCZsQfyRckWFYSJX5QAnxunE+G0k0OEdqA8x94zPqAkMz+wYxyNdVEvfc1wsu2n3V
            6Di1oEOTAPHT/sqy69rJGw96utNoT8kbJmTjYiU2h36tmmjB49QW6EBVfjCuBjll3y5xga
            YrehSe3cz7rbhp7rxgMgu32P+KHDB7Tb22UfZzdDizqp7sEbZk2K2kfQg/pUUlX7ytfrdh
            sXWV8FHcvDifFsFgFfgokRnYfeCmqnOivUH2PjcwoqmTVMsO+oQWPa0EmJXmLwKCuCgp0v
            AQQyXwq6OPQwdDXPENrjzLL94GGPIHNH6hI5KwyxXZnmQWc3BeGLvrDcd2EEnSatuBl+7v
            p+nZqWOO0VuKbGjDOTYcw20cQn7WBsgUdoTldfV+TcPs2Dkg/ihVwxoDK2HGj1v6iC3DDN
            g8SVHKFvsP5Zrl0t7FGUvLxDH3FkFl0YTI7zsyr2RtiKQN2xnlV2prZ1/vt95dpX8rAAAA
            wQC7lygS+374oQ2XCng4y4nuAWlseSELe7cwMacHopxnW6eNhaiXN8BImW9dU20p+zzCSN
            B7CZHnP6Poo6Ar0NE3ikoW+lEV2GX9Oq83dxV93Aw5mc4Cq2o2TA/QEfQFg0nTBPC1KWO9
            wqocvftb8Nl+DkUxFiWEoopD5Sgx37TQV/2JS6XD8q6YSzJqnh1k8eSWa2ghW51mi+1kPk
            XiW5Vhisc3qkWjQZNdvLxXKMiWbhzL6kk7diyqw9p7GJm9Q/0AAADBANhNb9OQbsEUyJOx
            nlWJE+mY6n/PGBnWLxlB6yNWfOz9JVFlSgoCgmOP2cUFfbLSCcYbltQrWq08aCEzTPHPnp
            pWP2HDKqYUYRwxHWwnbRNKcz0PLhLTTm1J/REaVJ8sVqxSCpZiiDJLvIemiWFxyji0qAMx
            XjsPhupzmfRx4n62eWZ+/d2/dTnXWFIqaO8+VKuDXQBPRLCQZCBUbRduo9FZguOHrE9cj4
            7F1TIMZfYqYtFt8Rn8uSh9okUksmdz/wAAAMEAwkk2eCUkIhcj3BP/xbeq3Vwi/mQUHAMJ
            NVe/CbIEszEk8aYCNWzCGHCFfsKv5XOG97zw8EVWk+JIelvy0BxPkhsVVSVUOD9TKMJDdO
            u5TPpo5tpjxe7dc0gpI0sB3ToL8NIbcz4S8cKbr87pG9MigaCiA5H1xaDCMMVQDmUuSZVl
            3rlmd64/FXajlg9tVhDk3bFa9Nx0Zyt645HdcypT2Ulf1ohtrJvKzCwVzsVjf9KfESkKRa
            9oHBMinSX3ZqNjAAAAF3l1dXRhQHl1dXRhLVRoaW5rUGFkRTE0AQID
            -----END OPENSSH PRIVATE KEY-----
            
                path: /home/ubuntu/.ssh/id_rsa
                permissions: '0600'
                owner: ubuntu:ubuntu
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.k3s_ansible_host_cloud_config_provisioner will be created
  + resource "null_resource" "k3s_ansible_host_cloud_config_provisioner" {
      + id = (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/203"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/121"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/120"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.gateway-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "gateway-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/122"
        name                   = "ssh-gateway-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-ansible-host is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "k3s-ansible-host" {
      ~ agent                  = 1 -> 0
      ~ boot                   = "order=scsi0" -> (known after apply)
      + bootdisk               = "virtio0"
      + cicustom               = "user=cephfs:snippets/ansible-host-cloud-config.yaml"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + desc                   = "Management Kubernetes cluster for Solufit"
      ~ id                     = "milky-capella/qemu/126" -> (known after apply)
      ~ ipconfig0              = "ip=dhcp" -> "ip=10.100.0.5/24"
      + ipconfig1              = "ip=dhcp"
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "k3s-ansible-host"
      + nameserver             = (known after apply)
      - numa                   = false -> null
      ~ onboot                 = true -> false
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      + searchdomain           = (known after apply)
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT
      + tags                   = (known after apply)
      ~ unused_disk            = [] -> (known after apply)
      ~ vm_state               = "stopped" -> "running"
      + vmid                   = (known after apply)
        # (47 unchanged attributes hidden)

      ~ disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = true -> null
                      - size                 = "6656M" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "16G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      ~ network {
          ~ bridge    = "vmbr2" -> "k3s"
          ~ macaddr   = "BC:24:11:0F:A0:5C" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = true
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      ~ smbios {
          + additional_wait             = (known after apply)
          + agent                       = (known after apply)
          + agent_timeout               = (known after apply)
          + args                        = (known after apply)
          + automatic_reboot            = (known after apply)
          + balloon                     = (known after apply)
          + bios                        = (known after apply)
          + boot                        = (known after apply)
          + bootdisk                    = (known after apply)
          + ci_wait                     = (known after apply)
          + cicustom                    = (known after apply)
          + cipassword                  = (known after apply)
          + ciuser                      = (known after apply)
          + clone                       = (known after apply)
          + clone_wait                  = (known after apply)
          + cores                       = (known after apply)
          + cpu                         = (known after apply)
          + default_ipv4_address        = (known after apply)
          + default_ipv6_address        = (known after apply)
          + define_connection_info      = (known after apply)
          + desc                        = (known after apply)
          + force_create                = (known after apply)
          + force_recreate_on_change_of = (known after apply)
          + full_clone                  = (known after apply)
          + hagroup                     = (known after apply)
          + hastate                     = (known after apply)
          + hotplug                     = (known after apply)
          + id                          = (known after apply)
          + ipconfig0                   = (known after apply)
          + ipconfig1                   = (known after apply)
          + ipconfig10                  = (known after apply)
          + ipconfig11                  = (known after apply)
          + ipconfig12                  = (known after apply)
          + ipconfig13                  = (known after apply)
          + ipconfig14                  = (known after apply)
          + ipconfig15                  = (known after apply)
          + ipconfig2                   = (known after apply)
          + ipconfig3                   = (known after apply)
          + ipconfig4                   = (known after apply)
          + ipconfig5                   = (known after apply)
          + ipconfig6                   = (known after apply)
          + ipconfig7                   = (known after apply)
          + ipconfig8                   = (known after apply)
          + ipconfig9                   = (known after apply)
          + kvm                         = (known after apply)
          + linked_vmid                 = (known after apply)
          + machine                     = (known after apply)
          + memory                      = (known after apply)
          + name                        = (known after apply)
          + nameserver                  = (known after apply)
          + numa                        = (known after apply)
          + onboot                      = (known after apply)
          + os_network_config           = (known after apply)
          + os_type                     = (known after apply)
          + pool                        = (known after apply)
          + protection                  = (known after apply)
          + pxe                         = (known after apply)
          + qemu_os                     = (known after apply)
          + reboot_required             = (known after apply)
          + scsihw                      = (known after apply)
          + searchdomain                = (known after apply)
          + skip_ipv4                   = (known after apply)
          + skip_ipv6                   = (known after apply)
          + sockets                     = (known after apply)
          + ssh_forward_ip              = (known after apply)
          + ssh_host                    = (known after apply)
          + ssh_port                    = (known after apply)
          + ssh_private_key             = (known after apply)
          + ssh_user                    = (known after apply)
          + sshkeys                     = (known after apply)
          + startup                     = (known after apply)
          + tablet                      = (known after apply)
          + tags                        = (known after apply)
          + target_node                 = (known after apply)
          + target_nodes                = (known after apply)
          + unused_disk                 = (known after apply)
          + vcpus                       = (known after apply)
          + vm_state                    = (known after apply)
          + vmid                        = (known after apply)
        } -> (known after apply)
    }

  # proxmox_vm_qemu.k3s-controller-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-controller-01" {
      + bootdisk               = "virtio0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-capella/qemu/125"
        name                   = "solufit-k3s-controller-01"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-worker-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-worker-01" {
      + bootdisk               = "virtio0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/127"
        name                   = "solufit-k3s-worker-01"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.workstation-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "workstation-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/123"
        name                   = "workstation-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 7 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Walkmana-25, Action: `pull_request`*